# brew install caskroom/cask/brew-cask

# brew tap Homebrew/bundle
# brew bundle
tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/versions' # for sublime-text-dev

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mas' # mac app store cli

# the first cask requires password to set up Caskroom
cask 'gog-galaxy' # requires password to install
cask 'steam'

cask 'vagrant' # requires password to install
cask 'virtualbox'
cask 'vmware-fusion'
cask 'docker-beta'

mas 'Slack', id: 803453959
cask 'hipchat'

mas 'Moom', id: 419330170
mas 'TrashMe', id: 443126292
mas 'Acorn', id: 1019272813
mas 'Affinity Designer', id: 824171161
mas 'Pixelmator', id: 407963104
mas 'Marked 2', id: 890031187
mas 'NetNewsWire', id: 635060292
mas 'MindNode', id: 992076693
mas 'Serial', id: 877615577
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Unclutter', id: 577085396
mas 'World Clock', id: 858446756
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Pocket', id: 568494494
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Ulysses', id: 623795237
mas 'iBooks Author', id: 490152466

cask 'caffeine'

brew 'openssl'

brew 'sassc'

# cask 'iterm2'
brew 'jq'

brew 'git'
brew 'hub'
brew 'git-lfs'
# brew 'mercurial'

brew 'ruby'
# brew 'python3'
# brew 'lua'
# brew 'luajit'
brew 'node'
brew 'elixir'

brew 'readline' # for Looper

mas 'Kindle', id: 405399194
brew 'epubcheck'
cask 'kindlegen'

brew 'awscli'
cask 'google-cloud-sdk'

brew 'redis'
cask 'postgres'
# brew 'mysql'
# cask 'sequel-pro'

cask 'google-chrome'
cask 'firefox'
# cask 'opera'
# cask 'opera-beta'
# cask 'transmission'

cask 'alfred'
cask '1password'
cask 'things'
cask 'dash'

cask 'sublime-text-dev'
cask 'textmate'
cask 'bbedit'
# cask 'atom'
# cask 'atom-beta'
# cask 'visual-studio-code'
# brew 'vim', args: ['with-luajit']
# brew 'neovim'

# cask 'karabiner'
# cask 'seil'

cask 'tower'
cask 'kaleidoscope'

cask 'dropbox'
cask 'superduper'
cask 'arq'
cask 'transmit'
cask 'daisydisk'
cask 'diskmaker-x' # to make USB keys for macOS installation
# cask 'softraid'
cask 'applepi-baker'

cask 'flux'
# cask 'duet'

# cask 'geekbench'

cask 'imageoptim'
# cask 'adobe-creative-cloud'
# cask 'adobe-photoshop-lightroom'
cask 'screenflow'

cask 'skype'

# brew 'gource'
brew 'youtube-dl'
brew 'ffmpeg'
# cask 'blu-ray-player'
cask 'handbrake'
# cask 'vlc'
# cask 'kodi'

cask 'logitech-gaming-software'
# cask 'razer-synapse'
# cask 'scroll-reverser'

# omnigraffle
# omnioutliner
# omnifocus
# macjournal
# mellel

# cask 'xquartz'
