# brew tap Homebrew/bundle
# brew bundle
# tap 'homebrew/bundle'
tap 'homebrew/cask-versions' # for sublime-text-dev

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mas' # Mac App Store CLI
# cask 'macupdater'

mas 'Xcode', id: 497799835
mas 'Developer', id: 640199958
mas 'Swift Playgrounds', id: 1496833156

# the first cask requires password to set up Caskroom
# cask 'vagrant' # requires password to install
# cask 'virtualbox'
# cask 'vmware-fusion'
cask 'docker'
# brew 'packer'

mas 'Slack', id: 803453959
# cask 'slack'
# cask 'hipchat'
# cask 'stride'
# cask 'discord'

# mas 'Pages', id: 409201541
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'GarageBand', id: 682658836
# mas 'iMovie', id: 408981434
mas 'Final Cut Pro', id: 424389933
mas 'Motion', id: 434290957

mas 'iBooks Author', id: 490152466
mas 'Marked 2', id: 890031187
# mas 'Ulysses', id: 623795237

mas 'Pixelmator Pro', id: 1289583905
mas 'Affinity Photo', id: 824183456
# mas 'Pixelmator', id: 407963104
# mas 'Acorn', id: 1019272813
mas 'Affinity Designer', id: 824171161

mas 'MindNode', id: 1289197285
mas 'Paprika Recipe Manager 3', id: 1303222628

mas 'Things', id: 904280696
mas 'Day One', id: 1055511498
mas 'Cardhop', id: 1290358394
mas 'Be Focused Pro', id: 961632517
mas 'Moom', id: 419330170
mas 'Unclutter', id: 577085396
mas 'World Clock Pro', id: 858446756

mas 'Disk Speed Test', id: 425264550
mas 'The Unarchiver', id: 425424353
# mas 'TrashMe', id: 443126292
cask 'appcleaner'

mas 'Serial', id: 877615577
cask 'applepi-baker'

mas 'Tweetbot', id: 1384080005
mas 'Deliveries', id: 924726344
mas 'Pocket', id: 568494494

mas 'GoodNotes', id: 1444383602

# mas 'NetNewsWire', id: 635060292
# mas 'ToothFairy', id: 961632517
# mas 'OpenGL Extensions Viewer', id: 444052073

mas 'Amphetamine', id: 937984704
#cask 'caffeine'

mas 'HiddenMe', id: 467040476
cask 'bartender'

cask 'keybase'
# brew 'openssl'
# brew 'gpg'
# brew 'gpg-agent'
# brew 'pinentry-mac'

brew 'hugo'

# cask 'iterm2'
# brew 'jq'

brew 'git'
brew 'hub'
# brew 'git-lfs'
# brew 'mercurial'

# brew 'ruby'
# brew 'python'
# brew 'lua'
# brew 'luajit'
brew 'node'
brew 'yarn'

# brew 'graphviz' # for goviz
# brew 'readline' # for Looper

mas 'Kindle', id: 405399194
brew 'epubcheck'
cask 'kindlegen'
cask 'kindle-previewer'

brew 'awscli'
# brew 'kubectl'
# brew 'kubernetes-helm'
# brew 'kops'
# brew 'terraform'
# brew 'vault'
# cask 'google-cloud-sdk'

cask 'postman'
cask 'ngrok'

brew 'redis'
cask 'postgres'
cask 'postico'
cask 'tableplus'
# brew 'mysql'
# cask 'sequel-pro'
# mas 'Navicat Essentials for PostgreSQL', id: 466725643

cask 'google-chrome'
# cask 'google-chrome-canary'
cask 'firefox-developer-edition'
cask 'safari-technology-preview'
# cask 'opera'
# cask 'opera-beta'
# cask 'transmission'
mas 'Magic Lasso', id: 1198047227

cask 'alfred'
cask '1password'
cask 'dash'

cask 'sublime-text-dev'
# cask 'textmate'
# cask 'bbedit'
cask 'visual-studio-code'
# brew 'vim', args: ['with-luajit']
# brew 'neovim'

# cask 'karabiner'
# cask 'seil'

cask 'tower'
cask 'kaleidoscope'

cask 'dropbox'
cask 'superduper'
cask 'arq'
cask 'transmit'
cask 'daisydisk'
cask 'diskmaker-x' # to make USB keys for macOS installation
# cask 'softraid'

# cask 'flux'

# cask 'geekbench'

cask 'imageoptim'
brew 'guetzli' # jpg compression

# cask 'adobe-acrobat-reader'
# cask 'adobe-creative-cloud'
mas 'Adobe Lightroom', id: 1451544217
cask 'screenflow'

cask 'skype'
# cask 'whatsapp'

# brew 'gource'
brew 'youtube-dl'
brew 'ffmpeg'
# cask 'blu-ray-player'
# cask 'handbrake'
# cask 'vlc'
# cask 'kodi'

cask 'omnigraffle'
# cask 'omnioutliner'
# cask 'omnifocus'
# macjournal 7
# mellel

# cask 'xquartz'

brew 'elixir'
# cask 'citrix-receiver'
cask 'zoomus'
cask 'microsoft-teams'
