# brew install caskroom/cask/brew-cask

# brew tap Homebrew/bundle
# brew bundle
tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/versions' # for sublime-text-dev

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mas' # mac app store cli

# the first cask requires password to set up Caskroom
cask 'vagrant' # requires password to install
cask 'virtualbox'
cask 'vmware-fusion'
cask 'docker'

# mas 'Slack', id: 803453959
cask 'slack'
cask 'hipchat'

mas 'Final Cut Pro', id: 424389933
# mas 'Cave Story+', id: 456447717
mas 'Things3', id: 904280696
mas 'TrashMe', id: 443126292
mas 'Blackmagic Disk Speed Test', id: 425264550
# mas 'Ulysses', id: 623795237
# mas 'Keynote', id: 409183694
mas 'Moom', id: 419330170
mas 'Navicat Essentials for PostgreSQL', id: 466725643
mas 'World Clock Pro', id: 858446756
# mas 'GarageBand', id: 682658836
mas 'The Unarchiver', id: 425424353
mas 'Acorn', id: 1019272813
mas 'Pixelmator', id: 407963104
mas 'iBooks Author', id: 490152466
mas 'Unclutter', id: 577085396
mas 'Motion', id: 434290957
mas 'Tweetbot', id: 557168941
# mas 'openglex5', id: 444052073
# mas 'Xcode', id: 497799835
mas 'Marked 2', id: 890031187
# mas 'Pages', id: 409201541
mas 'NetNewsWire', id: 635060292
mas 'MindNode', id: 992076693
# mas 'iMovie', id: 408981434
# mas 'Numbers', id: 409203825
mas 'Serial', id: 877615577
mas 'Day One', id: 1055511498
mas 'Affinity Designer', id: 824171161
mas 'Deliveries', id: 924726344
mas 'Pocket', id: 568494494

cask 'caffeine'

brew 'openssl'
brew 'gpg'
brew 'keybase'
brew 'gpg-agent'
brew 'pinentry-mac'

brew 'sassc'

# cask 'iterm2'
brew 'jq'

brew 'git'
brew 'hub'
brew 'git-lfs'
# brew 'mercurial'

brew 'ruby'
brew 'python3'
# brew 'lua'
# brew 'luajit'
brew 'node'
brew 'elixir'

brew 'graphviz' # for goviz
brew 'readline' # for Looper

mas 'Kindle', id: 405399194
brew 'epubcheck'
cask 'kindlegen'

brew 'awscli'
brew 'kubectl'
brew 'terraform'
brew 'vault'
cask 'google-cloud-sdk'

cask 'postman'
cask 'ngrok'

brew 'redis'
cask 'postgres'
cask 'postico'
# brew 'mysql'
cask 'sequel-pro'

cask 'google-chrome'
cask 'firefox'
# cask 'opera'
# cask 'opera-beta'
# cask 'transmission'

cask 'alfred'
cask '1password'
cask 'dash'

cask 'sublime-text-dev'
cask 'textmate'
cask 'bbedit'
cask 'visual-studio-code'

# cask 'atom'
# cask 'atom-beta'
# brew 'vim', args: ['with-luajit']
# brew 'neovim'

# cask 'karabiner'
# cask 'seil'

cask 'tower'
cask 'kaleidoscope'

cask 'dropbox'
cask 'superduper'
cask 'arq'
cask 'transmit'
cask 'daisydisk'
cask 'diskmaker-x' # to make USB keys for macOS installation
# cask 'softraid'
cask 'applepi-baker'

cask 'flux'

# cask 'geekbench'

cask 'imageoptim'
brew 'guetzli' # jpg compression

cask 'adobe-photoshop-lightroom'
cask 'screenflow'

cask 'skype'

# brew 'gource'
brew 'youtube-dl'
brew 'ffmpeg'
# cask 'blu-ray-player'
cask 'handbrake'
# cask 'vlc'
# cask 'kodi'

cask 'omnigraffle'
# omnioutliner
# omnifocus
# macjournal
# mellel

# cask 'xquartz'
